ws4/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     ibm;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         300;

deltaT          0.001;

writeControl    runTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;
adjustTimeStep no;

functions
{
	forces1
	{
   	 // Mandatory entries
   	 type            forces;
   	 functionObjectLibs ( "libforces.so" );
   	 patches         (top);
	   writeControl    runTime;
	   writeInterval   1;



    	// Optional entries

   	 // Field names
   	 pName               p;
   	 UName               U;
   	 rho             rhoInf;
	   rhoInf              1;

    	// Reference pressure [Pa]
    	pRef            0;

    	// Include porosity effects?
    	porosity        no;

    	// Store and write volume field representations of forces and moments
    	writeFields     yes;

    	// Centre of rotation for moment calculations
   	 CofR            (0 0 0);

    	// Spatial data binning
   	 // - extents given by the bounds of the input geometry
   	 //binData
    	 //{
   	 //   nBin        20;
   	 //  direction   (1 0 0);
    	//   cumulative  yes;
   	// }
	}

	forces2
	{
   	 // Mandatory entries
   	 type            forces;
   	 functionObjectLibs ( "libforces.so" );
   	 patches         (bottom);

	writeControl    runTime;
        writeInterval   1;
    	// Optional entries

   	 // Field names
   	 pName               p;
   	 UName               U;
   	 rho             rhoInf;
	   rhoInf              1;

    	// Reference pressure [Pa]
    	pRef            0;

    	// Include porosity effects?
    	porosity        no;

    	// Store and write volume field representations of forces and moments
    	writeFields     yes;

    	// Centre of rotation for moment calculations
   	 CofR            (0 0 0);

    	// Spatial data binning
   	 // - extents given by the bounds of the input geometry
   	 //binData
    	 //{
   	 //   nBin        20;
   	 //  direction   (1 0 0);
    	//   cumulative  yes;
   	// }
	}
}
